{
  "moduleId": "professional-case",
  "title": "Professional Case",
  "lead": "Even if writing doesn't feel essential, writing skills give you a competitive edge in the job market and help you collaborate effectively in any discipline.",
  "keyTakeaways": [
    "Employers value creative thinking and communication across fields.",
    "Writing helps you stand out when many candidates lean on AI.",
    "Judging AI output is itself a valuable skill—know what good writing looks like."
  ],
  "sections": [
    {
      "title": "Why Write Today?",
      "content": "We understand that not every reader will value the cognitive benefits of writing for their own sake. Different students have different skillsets, preferences, and goals. If students don't believe they have much talent for writing, or think that creativity and clarity of expression won't play a major role in their lives, should they disregard writing and outsource it to AI?\n\nWe think not. Even if writing isn't rewarding for everyone, there are still important reasons to develop some proficiency. Those who do are better positioned for career success."
    },
    {
      "title": "Evidence",
      "content": "Surveys suggest that skills cultivated through the writing process remain highly valuable for job-seekers across fields. The World Economic Forum's Future of Jobs Report 2023 found that a majority of organizations listed 'creative thinking' as a skill predicted to increase in importance by 2027.\n\nEven in fields where writing may not seem central, it is still valued. The American Chemical Society's guidelines for undergraduate chemistry programs note: 'Preparing students for the modern workplace requires more than technical skills. Surveys of employers consistently indicate the importance of interpersonal skills such as complex communication, social skills, teamwork, and the ability to work with a broad array of coworkers as essential to success in a wide range of areas. Effective departments train students to communicate effectively, including using relevant technology and information management, work collaboratively, and engage in the ethical conduct of science.'\n\nThis makes sense: even STEM professionals must frequently collaborate with others, and communication ability mediates any collaboration."
    },
    {
      "title": "Speculation",
      "content": "The job search is a competition between similarly qualified candidates. Standing out often means demonstrating strengths your competitors lack. If others rely on AI to generate writing in applications, one way to distinguish yourself is to write with creativity, novelty, and humanity that LLMs cannot match.\n\nEven in roles where AI automates much writing, quality control remains critical. The best candidates will be those who can judge the reliability of AI output—in other words, people with a sense of what good writing is."
    },
    {
      "title": "Conclusion",
      "content": "There are compelling non-academic reasons to develop writing abilities. The students best prepared for career success will be those who combine strong discipline-specific expertise with strong non-technical skills like communication. Outsourcing writing to an LLM undermines the latter."
    }
  ]
}